In [23]:
import pandas as pd

In [24]:
d = {
    'first':['corey','bella','julia'],
    'last' : ['singh','thompson','stephens'],
    'email' : ['schafer@','dabger@','annie@']
}

In [25]:
df1= pd.read_csv('developer/survey_results_public.csv')
schema_df = pd.read_csv('developer/survey_results_schema.csv',index_col='Column')

In [26]:
df = pd.DataFrame(d)
df

   first      last     email
0  corey     singh  schafer@
1  bella  thompson   dabger@
2  julia  stephens    annie@

In [27]:
 df

   first      last     email
0  corey     singh  schafer@
1  bella  thompson   dabger@
2  julia  stephens    annie@

In [28]:
df['fullname'] = df['first'] + ' ' + df['last'] #concatenate elements of 2 column

In [29]:
df

   first      last     email        fullname
0  corey     singh  schafer@     corey singh
1  bella  thompson   dabger@  bella thompson
2  julia  stephens    annie@  julia stephens

In [30]:
df.drop(columns = ['first','last']) #delete columns #inplace = True deletes permanently

      email        fullname
0  schafer@     corey singh
1   dabger@  bella thompson
2    annie@  julia stephens

In [31]:
df['fullname'].str.split(' ')

0       [corey, singh]
1    [bella, thompson]
2    [julia, stephens]
Name: fullname, dtype: object

In [50]:
c=df['fullname'].str.split(' ',expand = True)
c = pd.DataFrame(c)

In [56]:
c

       0         1
0  corey     singh
1  bella  thompson
2  julia  stephens

In [ ]:
#adding rows on df

In [70]:
df = df.append({'first':'Tony'},ignore_index=True)

In [71]:
df

   first      last     email        fullname
0  corey     singh  schafer@     corey singh
1  bella  thompson   dabger@  bella thompson
2  julia  stephens    annie@  julia stephens
3   Tony       NaN       NaN             NaN

In [72]:
avengers = {
    'first':['tony','steve','jarvis'],
    'last' : ['stark','rogers','stark'],
    'email' : ['tony@g','steve@a','jarv@s']
}

In [73]:
df2 = pd.DataFrame(avengers)

In [82]:
df2

    first    last    email
0    tony   stark   tony@g
1   steve  rogers  steve@a
2  jarvis   stark   jarv@s

In [84]:
avdf=df.append(df2,ignore_index = True) #appending two dataframe

In [86]:
avdf.drop(index = 5)

    first      last     email        fullname
0   corey     singh  schafer@     corey singh
1   bella  thompson   dabger@  bella thompson
2   julia  stephens    annie@  julia stephens
3    Tony       NaN       NaN             NaN
4    tony     stark    tony@g             NaN
6  jarvis     stark    jarv@s             NaN

In [89]:
filt = df['last'] == 'stark' ## removing stark last name rows

In [90]:
df.drop(index = df.loc[filt].index)

   first      last     email        fullname
0  corey     singh  schafer@     corey singh
1  bella  thompson   dabger@  bella thompson
2  julia  stephens    annie@  julia stephens
3   Tony       NaN       NaN             NaN